app-reading-log/app/controllers/book_notes_controller.rb

  def set_book_note
    @book_note = BookNote.find(params[:id])
---
SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 3 LIMIT 1