app-reading-log/app/controllers/book_notes_controller.rb

  def index
    @book_notes = BookNote.all
---
SELECT "book_notes".* FROM "book_notes"

  def show
    @book_note = BookNote.find(params[:id])
---
SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 1 LIMIT 1

  def create
    @book_note = BookNote.new(book_note_params)
    if @book_note.save
---
INSERT INTO "book_notes" ("title", "author", "status", "begin_date", "end_date", "content", "created_at", "updated_at") VALUES ('test-title', 'test-author', 1, '2025-03-04', '2025-03-13', 'sasa', '2025-03-31 05:15:07.524504', '2025-03-31 05:15:07.524504') RETURNING "id"

  def edit
    @book_note = BookNote.find(params[:id])
---
SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 1 LIMIT 1

  def update
    @book_note = BookNote.find(params[:id])
    if @book_note.update(book_note_params)
---
SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 2 LIMIT 1
UPDATE "book_notes" SET "content" = 'テストユーザーによる読了感想', "updated_at" = '2025-04-02 04:01:19.767477' WHERE "book_notes"."id" = 8

  def destroy
    @book_note = BookNote.find(params[:id])
    @book_note.destroy
---
SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 1 LIMIT 1
DELETE FROM "book_notes" WHERE "book_notes"."id" = 1