app-reading-log/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."book_note_id" = 1 AND "comments"."id" = 1 LIMIT 1
---
  def set_comment
    @comment = @book_note.comments.find(params[:id])