app-reading-log/app/controllers/comments_controller.rb

SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 2 LIMIT 1
INSERT INTO "comments" ("page", "impression", "book_note_id", "created_at", "updated_at") VALUES (123, 'dawdwadawdawd', 2, '2025-03-31 12:11:54.651065', '2025-03-31 12:11:54.651065') RETURNING "id"
---
  def create
    @book_note = BookNote.find(params[:book_note_id])
    @comment = @book_note.comments.build(comment_params)

    if @comment.save

SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 2 LIMIT 1
SELECT "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = 8 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."book_note_id" = 2 AND "comments"."id" = 1 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1
---
  def destroy
    @book_note = BookNote.find(params[:book_note_id])
    @comment = @book_note.comments.find(params[:id])
    @comment.destroy