app-reading-log/app/views/book_notes/show.html.erb

      <div class="comments-list">
        <% @book_note.comments.order(page: :asc).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."book_note_id" = 1 ORDER BY "comments"."page" ASC